In [ ]:
# import pandas and numpy libraries

In [1]:
import pandas as pd
import numpy as np

In [ ]:
# 1) Create a series 'val_series' with using the following 'values' array:
# values = [2, 5, 3, 10]

In [2]:
values = [2, 5, 3, 10]

In [3]:
val_series = pd.Series(values)
val_series

0     2
1     5
2     3
3    10
dtype: int64

In [ ]:
# 2-a) Create a dataframe 'rand_df' with 5 rows and 3 columns with values from the random normal distribution
# 2-b) Read 4th row
# 2-c) Read 2nd column

In [4]:
rand_df = pd.DataFrame(np.random.randn(5,3))
rand_df

          0         1         2
0  0.138791  1.082343  0.181884
1  0.455087 -0.192007  1.967696
2  0.146665  0.647685  1.907599
3 -1.282569  0.210522 -0.494378
4 -0.891239 -0.670699 -1.659537

In [5]:
rand_df.iloc[3]

0   -1.282569
1    0.210522
2   -0.494378
Name: 3, dtype: float64

In [6]:
rand_df.iloc[:,1]

0    1.082343
1   -0.192007
2    0.647685
3    0.210522
4   -0.670699
Name: 1, dtype: float64

In [ ]:
# 3-a) Create a dataframe 'color_random' using the following statement
# color_random = pd.DataFrame(np.random.randn(4,6), ['Red','Blue','Green','Yellow'], ['a','b','c','d','e','f'])
# 3-b) Read the value at Blue row and 'd' column
# 3-c) Read the values from Green to Yellow and from b to e

In [7]:
color_random = pd.DataFrame(np.random.randn(4,6), ['Red','Blue','Green','Yellow'], ['a','b','c','d','e','f'])
color_random

               a         b         c         d         e         f
Red     0.730368  0.361170  2.569615 -0.146034 -0.987977 -1.449935
Blue   -1.494791  0.460236  0.738211 -1.238799  1.922390  0.519518
Green   0.831678 -1.359926  0.798670  0.218831  1.639270 -0.096424
Yellow  0.319238 -0.979635 -1.482609 -0.818468 -0.975396 -0.578816

In [8]:
color_random.loc['Blue','d']

-1.2387989523553133

In [9]:
color_random.loc['Green':'Yellow','b':'e']

               b         c         d         e
Green  -1.359926  0.798670  0.218831  1.639270
Yellow -0.979635 -1.482609 -0.818468 -0.975396

In [ ]:
# 4-a) Create a dataframe from the file 'AAPL_data.csv' - provided in course resources
# 4-b) show max, min and average volume

In [10]:
aapl = pd.read_csv("C:\\Users\\Zain\\Downloads\\AAPL_data.csv")
aapl

          date     open      high       low   close    volume  Name
0   2018-01-02  170.160  172.3000  169.2600  172.26  25555934  AAPL
1   2018-01-03  172.530  174.5500  171.9600  172.23  29517899  AAPL
2   2018-01-04  172.540  173.4700  172.0800  173.03  22434597  AAPL
3   2018-01-05  173.440  175.3700  173.0500  175.00  23660018  AAPL
4   2018-01-08  174.350  175.6100  173.9300  174.35  20567766  AAPL
5   2018-01-09  174.550  175.0600  173.4100  174.33  21583997  AAPL
6   2018-01-10  173.160  174.3000  173.0000  174.29  23959895  AAPL
7   2018-01-11  174.590  175.4886  174.4900  175.28  18667729  AAPL
8   2018-01-12  176.180  177.3600  175.6500  177.09  25418080  AAPL
9   2018-01-16  177.900  179.3900  176.1400  176.19  29565947  AAPL
10  2018-01-17  176.150  179.2500  175.0700  179.10  34386836  AAPL
11  2018-01-18  179.370  180.1000  178.2500  179.26  31193352  AAPL
12  2018-01-19  178.610  179.5800  177.4100  178.46  32425067  AAPL
13  2018-01-22  177.300  177.7800  176.6016  177.00  27108551  AAPL
14  2018-01-23  177.300  179.4400  176.8200  177.04  32689146  AAPL
15  2018-01-24  177.250  177.3000  173.2000  174.22  51105090  AAPL
16  2018-01-25  174.505  174.9500  170.5300  171.11  41529004  AAPL
17  2018-01-26  172.000  172.0000  170.0600  171.51  39143011  AAPL
18  2018-01-29  170.160  170.1600  167.0700  167.96  50640406  AAPL
19  2018-01-30  165.525  167.3700  164.7000  166.97  46048185  AAPL
20  2018-01-31  166.870  168.4417  166.5000  167.43  32478930  AAPL

In [11]:
aapl['volume'].min()

18667729

In [12]:
aapl['volume'].max()

51105090

In [13]:
aapl['volume'].mean()

31413306.666666668